/*
 * Permission is hereby granted, free of charge, to any human obtaining a copy of this software and associated documentation files
 * (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify,
 * merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit humans to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE
 * LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

// To ensure safety we provice separate types for different classes of registers.
// But Rust compiler currently is not advanced enough to produce e.g. effective conversion from 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 to
// 𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢: while you just need to copy value without doing anything compiler doesn't always optimize
// checks away.

// To make sure this woulnd't happen we are providing that conversion only for tests: 𝒘𝒓𝒂𝒑𝒑𝒆𝒓_𝒇𝒐𝒓_𝒕𝒆𝒔𝒕<𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜>
// would be converted to 𝒘𝒓𝒂𝒑𝒑𝒆𝒓_𝒇𝒐𝒓_𝒕𝒆𝒔𝒕<𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢> using safe code and matching values.

// The actual, production, conversion is compared to that one on the full range of 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜.

// This way we can guarantee that our tests are enough to ensure safety.
// Note: since mistakes here may trigger undefined behavior tests have to be run with “cargo +nightly miri test”.

𝖉𝖊𝖋𝖎𝖓𝖊_𝖊𝖓𝖚𝖒𝖘! {
    [{|value| !(1..=15).contains(&value)}]
    [𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {|value| value > 15},
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {|value| value > 15},
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {|value| value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {|value| value == 0 || value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {|value| value == 0 || value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {|value| value == 0 || value > 15}
    ]
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞 {
        𝔵1 = 1,
        𝔵2 = 2,
        𝔵3 = 3,
        𝔵4 = 4,
        𝔵5 = 5,
        𝔵6 = 6,
        𝔵7 = 7,
        𝔵8 = 8,
        𝔵9 = 9,
        𝔵10 = 10,
        𝔵11 = 11,
        𝔵12 = 12,
        𝔵13 = 13,
        𝔵14 = 14,
        𝔵15 = 15
    }
    Display: {
        self => if *self < 𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞::𝔵10 {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝐫𝐯𝟑𝟐𝐞_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 2]
        } else {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝐫𝐯𝟑𝟐𝐞_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 3]
        }
    }

    [{|value| !(1..=31).contains(&value)}]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢
    ]
    [   𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {|value| value == 0}
    ]
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {
        𝔵1 = 1,
        𝔵2 = 2,
        𝔵3 = 3,
        𝔵4 = 4,
        𝔵5 = 5,
        𝔵6 = 6,
        𝔵7 = 7,
        𝔵8 = 8,
        𝔵9 = 9,
        𝔵10 = 10,
        𝔵11 = 11,
        𝔵12 = 12,
        𝔵13 = 13,
        𝔵14 = 14,
        𝔵15 = 15,
        𝔵16 = 16,
        𝔵17 = 17,
        𝔵18 = 18,
        𝔵19 = 19,
        𝔵20 = 20,
        𝔵21 = 21,
        𝔵22 = 22,
        𝔵23 = 23,
        𝔵24 = 24,
        𝔵25 = 25,
        𝔵26 = 26,
        𝔵27 = 27,
        𝔵28 = 28,
        𝔵29 = 29,
        𝔵30 = 30,
        𝔵31 = 31
    }
    Display: {
        self => if *self < 𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜::𝔵10 {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 2]
        } else {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 3]
        }
    }

    [{|value| !(1..=15).contains(&value)}]
    [𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {|value| value > 15},
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {|value| value > 15},
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {|value| value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {|value| value == 0 || value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {|value| value == 0 || value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {|value| value == 0 || value > 15}
    ]
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞 {
        𝔯𝔞 = 1,
        𝔰𝔭 = 2,
        𝔤𝔭 = 3,
        𝔱𝔭 = 4,
        𝔱0 = 5,
        𝔰3 = 6,
        𝔰4 = 7,
        𝔰0 = 8,
        𝔰1 = 9,
        𝔞0 = 10,
        𝔞1 = 11,
        𝔞2 = 12,
        𝔞3 = 13,
        𝔰2 = 14,
        𝔱1 = 15
    }
    Display: {self => &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞_𝔫𝔞𝔪𝔢𝔰[*self as usize * 2..*self as usize * 2 + 2]}

    [{|value| !(1..=31).contains(&value)}]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢
    ]
    [   𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {|value| value == 0}
    ]
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {
        𝔯𝔞 = 1,
        𝔰𝔭 = 2,
        𝔤𝔭 = 3,
        𝔱𝔭 = 4,
        𝔱0 = 5,
        𝔰3 = 6,
        𝔰4 = 7,
        𝔰0 = 8,
        𝔰1 = 9,
        𝔞0 = 10,
        𝔞1 = 11,
        𝔞2 = 12,
        𝔞3 = 13,
        𝔰2 = 14,
        𝔱1 = 15,
        𝔰5 = 16,
        𝔰6 = 17,
        𝔰7 = 18,
        𝔰8 = 19,
        𝔰9 = 20,
        𝔰10 = 21,
        𝔰11 = 22,
        𝔰12 = 23,
        𝔰13 = 24,
        𝔰14 = 25,
        𝔰15 = 26,
        𝔰16 = 27,
        𝔰17 = 28,
        𝔰18 = 29,
        𝔰19 = 30,
        𝔰20 = 31
    }
    Display: {
        self => if *self < 𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢::𝔰10 {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐞𝐚𝐛𝐢_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 2]
        } else {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐞𝐚𝐛𝐢_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 3]
        }
    }

    [{|value| !(1..=31).contains(&value)}]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢
    ]
    [   𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {|value| value == 0},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {|value| value == 0}
    ]
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {
        𝔯𝔞 = 1,
        𝔰𝔭 = 2,
        𝔤𝔭 = 3,
        𝔱𝔭 = 4,
        𝔱0 = 5,
        𝔱1 = 6,
        𝔱2 = 7,
        𝔰0 = 8,
        𝔰1 = 9,
        𝔞0 = 10,
        𝔞1 = 11,
        𝔞2 = 12,
        𝔞3 = 13,
        𝔞4 = 14,
        𝔞5 = 15,
        𝔞6 = 16,
        𝔞7 = 17,
        𝔰2 = 18,
        𝔰3 = 19,
        𝔰4 = 20,
        𝔰5 = 21,
        𝔰6 = 22,
        𝔰7 = 23,
        𝔰8 = 24,
        𝔰9 = 25,
        𝔰10 = 26,
        𝔰11 = 27,
        𝔱3 = 28,
        𝔱4 = 29,
        𝔱5 = 30,
        𝔱6 = 31
    }
    Display: {
        self => if *self as usize & 0x1e != 0x1a {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐮𝐚𝐛𝐢_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 2]
        } else {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐮𝐚𝐛𝐢_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 3]
        }
    }

    [{|value| !(0..=15).contains(&value)}]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞
    ]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {|value| value > 15},
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {|value| value > 15},
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {|value| value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {|value| value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {|value| value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {|value| value > 15}
    ]
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞 {
        𝔵0 = 0,
        𝔵1 = 1,
        𝔵2 = 2,
        𝔵3 = 3,
        𝔵4 = 4,
        𝔵5 = 5,
        𝔵6 = 6,
        𝔵7 = 7,
        𝔵8 = 8,
        𝔵9 = 9,
        𝔵10 = 10,
        𝔵11 = 11,
        𝔵12 = 12,
        𝔵13 = 13,
        𝔵14 = 14,
        𝔵15 = 15
    }
    Display: {
        self => if *self < 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞::𝔵10 {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝐫𝐯𝟑𝟐𝐞_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 2]
        } else {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝐫𝐯𝟑𝟐𝐞_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 3]
        }
    }

    [{|value| !(0..=31).contains(&value)}]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢
    ]
    []
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {
        𝔵0 = 0,
        𝔵1 = 1,
        𝔵2 = 2,
        𝔵3 = 3,
        𝔵4 = 4,
        𝔵5 = 5,
        𝔵6 = 6,
        𝔵7 = 7,
        𝔵8 = 8,
        𝔵9 = 9,
        𝔵10 = 10,
        𝔵11 = 11,
        𝔵12 = 12,
        𝔵13 = 13,
        𝔵14 = 14,
        𝔵15 = 15,
        𝔵16 = 16,
        𝔵17 = 17,
        𝔵18 = 18,
        𝔵19 = 19,
        𝔵20 = 20,
        𝔵21 = 21,
        𝔵22 = 22,
        𝔵23 = 23,
        𝔵24 = 24,
        𝔵25 = 25,
        𝔵26 = 26,
        𝔵27 = 27,
        𝔵28 = 28,
        𝔵29 = 29,
        𝔵30 = 30,
        𝔵31 = 31
    }
    Display: {
        self => if *self < 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜::𝔵10 {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 2]
        } else {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 3]
        }
    }

    [{|value| !(0..=15).contains(&value)}]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞
    ]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {|value| value > 15},
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {|value| value > 15},
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {|value| value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {|value| value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {|value| value > 15},
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {|value| value > 15}
    ]
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞 {
        𝔷𝔢𝔯𝔬 = 0,
        𝔯𝔞 = 1,
        𝔰𝔭 = 2,
        𝔤𝔭 = 3,
        𝔱𝔭 = 4,
        𝔱0 = 5,
        𝔰3 = 6,
        𝔰4 = 7,
        𝔰0 = 8,
        𝔰1 = 9,
        𝔞0 = 10,
        𝔞1 = 11,
        𝔞2 = 12,
        𝔞3 = 13,
        𝔰2 = 14,
        𝔱1 = 15
    }
    Display: {
        self => if *self != 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞::𝔷𝔢𝔯𝔬 {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞_𝔫𝔞𝔪𝔢𝔰[*self as usize * 2..*self as usize * 2 + 2]
        } else {
            b"zero"
        }
    }

    [{|value| !(0..=31).contains(&value)}]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢
    ]
    []
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢 {
        𝔷𝔢𝔯𝔬 = 0,
        𝔯𝔞 = 1,
        𝔰𝔭 = 2,
        𝔤𝔭 = 3,
        𝔱𝔭 = 4,
        𝔱0 = 5,
        𝔰3 = 6,
        𝔰4 = 7,
        𝔰0 = 8,
        𝔰1 = 9,
        𝔞0 = 10,
        𝔞1 = 11,
        𝔞2 = 12,
        𝔞3 = 13,
        𝔰2 = 14,
        𝔱1 = 15,
        𝔰5 = 16,
        𝔰6 = 17,
        𝔰7 = 18,
        𝔰8 = 19,
        𝔰9 = 20,
        𝔰10 = 21,
        𝔰11 = 22,
        𝔰12 = 23,
        𝔰13 = 24,
        𝔰14 = 25,
        𝔰15 = 26,
        𝔰16 = 27,
        𝔰17 = 28,
        𝔰18 = 29,
        𝔰19 = 30,
        𝔰20 = 31
    }
    Display: {
        self => if *self > 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢::𝔰9 {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐞𝐚𝐛𝐢_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 3]
        } else if *self > 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢::𝔷𝔢𝔯𝔬 {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐞𝐚𝐛𝐢_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 2]
        } else {
            b"zero"
        }
    }

    [{|value| !(0..=31).contains(&value)}]
    [   𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢,
        𝐧𝐨𝐳𝐞𝐫𝐨_𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞,
        𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢
    ]
    []
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢 {
        𝔷𝔢𝔯𝔬 = 0,
        𝔯𝔞 = 1,
        𝔰𝔭 = 2,
        𝔤𝔭 = 3,
        𝔱𝔭 = 4,
        𝔱0 = 5,
        𝔱1 = 6,
        𝔱2 = 7,
        𝔰0 = 8,
        𝔰1 = 9,
        𝔞0 = 10,
        𝔞1 = 11,
        𝔞2 = 12,
        𝔞3 = 13,
        𝔞4 = 14,
        𝔞5 = 15,
        𝔞6 = 16,
        𝔞7 = 17,
        𝔰2 = 18,
        𝔰3 = 19,
        𝔰4 = 20,
        𝔰5 = 21,
        𝔰6 = 22,
        𝔰7 = 23,
        𝔰8 = 24,
        𝔰9 = 25,
        𝔰10 = 26,
        𝔰11 = 27,
        𝔱3 = 28,
        𝔱4 = 29,
        𝔱5 = 30,
        𝔱6 = 31
    }
    Display: {
        self => if *self == 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢::𝔷𝔢𝔯𝔬 {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐮𝐚𝐛𝐢_𝔫𝔞𝔪𝔢𝔰[0..4]
        } else if *self as usize & 0x1e != 0x1a {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐮𝐚𝐛𝐢_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 2]
        } else {
            &𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐮𝐚𝐛𝐢_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 3]
        }
    }

    [{|value| !(0..=31).contains(&value)}]
    [𝐟𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐚𝐛𝐢]
    []
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐟𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜 {
        𝔣0 = 0,
        𝔣1 = 1,
        𝔣2 = 2,
        𝔣3 = 3,
        𝔣4 = 4,
        𝔣5 = 5,
        𝔣6 = 6,
        𝔣7 = 7,
        𝔣8 = 8,
        𝔣9 = 9,
        𝔣10 = 10,
        𝔣11 = 11,
        𝔣12 = 12,
        𝔣13 = 13,
        𝔣14 = 14,
        𝔣15 = 15,
        𝔣16 = 16,
        𝔣17 = 17,
        𝔣18 = 18,
        𝔣19 = 19,
        𝔣20 = 20,
        𝔣21 = 21,
        𝔣22 = 22,
        𝔣23 = 23,
        𝔣24 = 24,
        𝔣25 = 25,
        𝔣26 = 26,
        𝔣27 = 27,
        𝔣28 = 28,
        𝔣29 = 29,
        𝔣30 = 30,
        𝔣31 = 31
    }
    Display: {
        self => if *self < 𝐟𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜::𝔣10 {
            &𝔣𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 2]
        } else {
            &𝔣𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 3]
        }
    }

    [{|value| !(0..=31).contains(&value)}]
    [𝐟𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜]
    []
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐟𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐚𝐛𝐢 {
        𝔣𝔱0 = 0,
        𝔣𝔱1 = 1,
        𝔣𝔱2 = 2,
        𝔣𝔱3 = 3,
        𝔣𝔱4 = 4,
        𝔣𝔱5 = 5,
        𝔣𝔱6 = 6,
        𝔣𝔱7 = 7,
        𝔣𝔰0 = 8,
        𝔣𝔰1 = 9,
        𝔣𝔞0 = 10,
        𝔣𝔞1 = 11,
        𝔣𝔞2 = 12,
        𝔣𝔞3 = 13,
        𝔣𝔞4 = 14,
        𝔣𝔞5 = 15,
        𝔣𝔞6 = 16,
        𝔣𝔞7 = 17,
        𝔣𝔰2 = 18,
        𝔣𝔰3 = 19,
        𝔣𝔰4 = 20,
        𝔣𝔰5 = 21,
        𝔣𝔰6 = 22,
        𝔣𝔰7 = 23,
        𝔣𝔰8 = 24,
        𝔣𝔰9 = 25,
        𝔣𝔰10 = 26,
        𝔣𝔰11 = 27,
        𝔣𝔱8 = 28,
        𝔣𝔱9 = 29,
        𝔣𝔱10 = 30,
        𝔣𝔱11 = 31
    }
    Display: {
        self => if *self as usize & 0x1e != 0x1a && *self as usize & 0x1e != 0x1e {
            &𝔣𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔞𝔟𝔦_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 3]
        } else {
            &𝔣𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔞𝔟𝔦_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + 4]
        }
    }

    [{|value| !(0..=4).contains(&value) && value != 7}]
    []
    []
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐫𝐨𝐮𝐧𝐝𝐢𝐧𝐠_𝐦𝐨𝐝𝐞 {
        𝔯𝔫𝔢 = 0,
        𝔯𝔱𝔷 = 1,
        𝔯𝔡𝔫 = 2,
        𝔯𝔲𝔭 = 3,
        𝔯𝔪𝔪 = 4,
        𝔡𝔶𝔫 = 7
    }
    Display: {self => &𝔯𝔬𝔲𝔫𝔡𝔦𝔫𝔤_𝔪𝔬𝔡𝔢_𝔫𝔞𝔪𝔢[*self as usize * 4..*self as usize * 4 + 3]}

    [{|value| !(1..=15).contains(&value)}]
    []
    []
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i8/u8)]
    pub enum 𝐟𝐞𝐧𝐜𝐞 {
        𝔴 = 1,
        𝔯 = 2,
        𝔯𝔴 = 3,
        𝔬 = 4,
        𝔬𝔴 = 5,
        𝔬𝔯 = 6,
        𝔬𝔯𝔴 = 7,
        𝔦 = 8,
        𝔦𝔴 = 9,
        𝔦𝔯 = 10,
        𝔦𝔯𝔴 = 11,
        𝔦𝔬 = 12,
        𝔦𝔬𝔴 = 13,
        𝔦𝔬𝔯 = 14,
        𝔦𝔬𝔯𝔴 = 15
    }
    Display: {self => &𝔣𝔢𝔫𝔠𝔢_𝔫𝔞𝔪𝔢𝔰[*self as usize * 4..*self as usize * 4 + (*self as usize).count_ones() as usize]}

    [{|value| !(0x001..=0x003).contains(&value) &&
              value != 0x100 &&
              !(0x104..=0x106).contains(&value) &&
              value != 0x10a &&
              !(0x140..=0x144).contains(&value) &&
              value != 0x180 &&
              value != 0x200 &&
              !(0x204..=0x205).contains(&value) &&
              !(0x240..=0x244).contains(&value) &&
              value != 0x280 &&
              !(0x300..=0x306).contains(&value) &&
              value != 0x30a &&
              value != 0x310 &&
              value != 0x31a &&
              value != 0x320 &&
              !(0x323..=0x344).contains(&value) &&
              !(0x34a..=0x34b).contains(&value) &&
              !(0x3a0..=0x3ef).contains(&value) &&
              value != 0x5a8 &&
              value != 0x5a8 &&
              value != 0x600 &&
              !(0x602..=0x607).contains(&value) &&
              value != 0x60a &&
              value != 0x615 &&
              value != 0x61a &&
              !(0x643..=0x645).contains(&value) &&
              value != 0x64a &&
              value != 0x747 &&
              value != 0x757 &&
              !(0x7a0..=0x7a3).contains(&value) &&
              value != 0x7a8 &&
              !(0x7b0..=0x7b3).contains(&value) &&
              value != 0xb00 &&
              !(0xb02..=0xb1f).contains(&value) &&
              value != 0xb80 &&
              !(0xb82..=0xb9f).contains(&value) &&
              !(0xc00..=0xc1f).contains(&value) &&
              !(0xc80..=0xc9f).contains(&value) &&
              value != 0xe12 &&
              !(0xf11..=0xf15).contains(&value)}]
    [𝐜𝐬𝐫_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐫𝐯𝟔𝟒]
    []
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i16/u16)]
    pub enum 𝐜𝐬𝐫_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐫𝐯𝟑𝟐 {
        𝔣𝔣𝔩𝔞𝔤𝔰 = 0x001,
        𝔣𝔯𝔪 = 0x002,
        𝔣𝔠𝔰𝔯 = 0x003,
        𝔰𝔰𝔱𝔞𝔱𝔲𝔰 = 0x100,
        𝔰𝔦𝔢 = 0x104,
        𝔰𝔱𝔳𝔢𝔠 = 0x105,
        𝔰𝔠𝔬𝔲𝔫𝔱𝔢𝔯𝔢𝔫 = 0x106,
        𝔰𝔢𝔫𝔳𝔠𝔣𝔤 = 0x10a,
        𝔰𝔰𝔠𝔯𝔞𝔱𝔠𝔥 = 0x140,
        𝔰𝔢𝔭𝔠 = 0x141,
        𝔰𝔠𝔞𝔲𝔰𝔢 = 0x142,
        𝔰𝔱𝔳𝔞𝔩 = 0x143,
        𝔰𝔦𝔭 = 0x144,
        𝔰𝔞𝔱𝔭 = 0x180,
        𝔳𝔰𝔰𝔱𝔞𝔱𝔲𝔰 = 0x200,
        𝔳𝔰𝔦𝔢 = 0x204,
        𝔳𝔰𝔱𝔳𝔢𝔠 = 0x205,
        𝔳𝔰𝔰𝔠𝔯𝔞𝔱𝔠𝔥 = 0x240,
        𝔳𝔰𝔢𝔭𝔠 = 0x241,
        𝔳𝔰𝔠𝔞𝔲𝔰𝔢 = 0x242,
        𝔳𝔰𝔱𝔳𝔞𝔩 = 0x243,
        𝔳𝔰𝔦𝔭 = 0x244,
        𝔳𝔰𝔞𝔱𝔭 = 0x280,
        𝔪𝔰𝔱𝔞𝔱𝔲𝔰 = 0x300,
        𝔪𝔦𝔰𝔞 = 0x301,
        𝔪𝔢𝔡𝔢𝔩𝔢𝔤 = 0x302,
        𝔪𝔦𝔡𝔢𝔩𝔢𝔤 = 0x303,
        𝔪𝔦𝔢 = 0x304,
        𝔪𝔱𝔳𝔢𝔠 = 0x305,
        𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯𝔢𝔫 = 0x306,
        𝔪𝔢𝔫𝔳𝔠𝔣𝔤 = 0x30a,
        𝔪𝔰𝔱𝔞𝔱𝔲𝔰𝔥 = 0x310,
        𝔪𝔢𝔫𝔳𝔠𝔣𝔤𝔥 = 0x31a,
        𝔪𝔠𝔬𝔲𝔫𝔱𝔦𝔫𝔥𝔦𝔟𝔦𝔱 = 0x320,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱3 = 0x323,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱4 = 0x324,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱5 = 0x325,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱6 = 0x326,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱7 = 0x327,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱8 = 0x328,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱9 = 0x329,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱10 = 0x32a,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱11 = 0x32b,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱12 = 0x32c,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱13 = 0x32d,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱14 = 0x32e,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱15 = 0x32f,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱16 = 0x330,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱17 = 0x331,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱18 = 0x332,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱19 = 0x333,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱20 = 0x334,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱21 = 0x335,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱22 = 0x336,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱23 = 0x337,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱24 = 0x338,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱25 = 0x339,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱26 = 0x33a,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱27 = 0x33b,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱28 = 0x33c,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱29 = 0x33d,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱30 = 0x33e,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱31 = 0x33f,
        𝔪𝔰𝔠𝔯𝔞𝔱𝔠𝔥 = 0x340,
        𝔪𝔢𝔭𝔠 = 0x341,
        𝔪𝔠𝔞𝔲𝔰𝔢 = 0x342,
        𝔪𝔱𝔳𝔞𝔩 = 0x343,
        𝔪𝔦𝔭 = 0x344,
        𝔪𝔱𝔦𝔫𝔰𝔱 = 0x34a,
        𝔪𝔱𝔳𝔞𝔩2 = 0x34b,
        𝔭𝔪𝔭𝔠𝔣𝔤0 = 0x3a0,
        𝔭𝔪𝔭𝔠𝔣𝔤1 = 0x3a1,
        𝔭𝔪𝔭𝔠𝔣𝔤2 = 0x3a2,
        𝔭𝔪𝔭𝔠𝔣𝔤3 = 0x3a3,
        𝔭𝔪𝔭𝔠𝔣𝔤4 = 0x3a4,
        𝔭𝔪𝔭𝔠𝔣𝔤5 = 0x3a5,
        𝔭𝔪𝔭𝔠𝔣𝔤6 = 0x3a6,
        𝔭𝔪𝔭𝔠𝔣𝔤7 = 0x3a7,
        𝔭𝔪𝔭𝔠𝔣𝔤8 = 0x3a8,
        𝔭𝔪𝔭𝔠𝔣𝔤9 = 0x3a9,
        𝔭𝔪𝔭𝔠𝔣𝔤10 = 0x3aa,
        𝔭𝔪𝔭𝔠𝔣𝔤11 = 0x3ab,
        𝔭𝔪𝔭𝔠𝔣𝔤12 = 0x3ac,
        𝔭𝔪𝔭𝔠𝔣𝔤13 = 0x3ad,
        𝔭𝔪𝔭𝔠𝔣𝔤14 = 0x3ae,
        𝔭𝔪𝔭𝔠𝔣𝔤15 = 0x3af,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯0 = 0x3b0,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯1 = 0x3b1,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯2 = 0x3b2,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯3 = 0x3b3,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯4 = 0x3b4,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯5 = 0x3b5,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯6 = 0x3b6,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯7 = 0x3b7,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯8 = 0x3b8,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯9 = 0x3b9,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯10 = 0x3ba,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯11 = 0x3bb,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯12 = 0x3bc,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯13 = 0x3bd,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯14 = 0x3be,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯15 = 0x3bf,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯16 = 0x3c0,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯17 = 0x3c1,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯18 = 0x3c2,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯19 = 0x3c3,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯20 = 0x3c4,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯21 = 0x3c5,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯22 = 0x3c6,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯23 = 0x3c7,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯24 = 0x3c8,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯25 = 0x3c9,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯26 = 0x3ca,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯27 = 0x3cb,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯28 = 0x3cc,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯29 = 0x3cd,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯30 = 0x3ce,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯31 = 0x3cf,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯32 = 0x3d0,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯33 = 0x3d1,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯34 = 0x3d2,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯35 = 0x3d3,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯36 = 0x3d4,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯37 = 0x3d5,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯38 = 0x3d6,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯39 = 0x3d7,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯40 = 0x3d8,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯41 = 0x3d9,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯42 = 0x3da,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯43 = 0x3db,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯44 = 0x3dc,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯45 = 0x3dd,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯46 = 0x3de,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯47 = 0x3df,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯48 = 0x3e0,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯49 = 0x3e1,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯50 = 0x3e2,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯51 = 0x3e3,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯52 = 0x3e4,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯53 = 0x3e5,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯54 = 0x3e6,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯55 = 0x3e7,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯56 = 0x3e8,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯57 = 0x3e9,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯58 = 0x3ea,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯59 = 0x3eb,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯60 = 0x3ec,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯61 = 0x3ed,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯62 = 0x3ee,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯63 = 0x3ef,
        𝔰𝔠𝔬𝔫𝔱𝔢𝔵𝔱 = 0x5a8,
        𝔥𝔰𝔱𝔞𝔱𝔲𝔰 = 0x600,
        𝔥𝔢𝔡𝔢𝔩𝔢𝔤 = 0x602,
        𝔥𝔦𝔡𝔢𝔩𝔢𝔤 = 0x603,
        𝔥𝔦𝔢 = 0x604,
        𝔥𝔱𝔦𝔪𝔢𝔡𝔢𝔩𝔱𝔞 = 0x605,
        𝔥𝔠𝔬𝔲𝔫𝔱𝔢𝔯𝔢𝔫 = 0x606,
        𝔥𝔤𝔢𝔦𝔢 = 0x607,
        𝔥𝔢𝔫𝔳𝔠𝔣𝔤 = 0x60a,
        𝔥𝔱𝔦𝔪𝔢𝔡𝔢𝔩𝔱𝔞𝔥 = 0x615,
        𝔥𝔢𝔫𝔳𝔠𝔣𝔤𝔥 = 0x61a,
        𝔥𝔱𝔳𝔞𝔩 = 0x643,
        𝔥𝔦𝔭 = 0x644,
        𝔥𝔳𝔦𝔭 = 0x645,
        𝔥𝔱𝔦𝔫𝔰𝔱 = 0x64a,
        𝔪𝔰𝔢𝔠𝔠𝔣𝔤 = 0x747,
        𝔪𝔰𝔢𝔠𝔠𝔣𝔤𝔥 = 0x757,
        𝔱𝔰𝔢𝔩𝔢𝔠𝔱 = 0x7a0,
        𝔱𝔡𝔞𝔱𝔞1 = 0x7a1,
        𝔱𝔡𝔞𝔱𝔞2 = 0x7a2,
        𝔱𝔡𝔞𝔱𝔞3 = 0x7a3,
        𝔪𝔠𝔬𝔫𝔱𝔢𝔵𝔱 = 0x7a8,
        𝔡𝔠𝔰𝔯 = 0x7b0,
        𝔡𝔭𝔠 = 0x7b1,
        𝔡𝔰𝔠𝔯𝔞𝔱𝔠𝔥0 = 0x7b2,
        𝔡𝔰𝔠𝔯𝔞𝔱𝔠𝔥1 = 0x7b3,
        𝔪𝔠𝔶𝔠𝔩𝔢 = 0xb00,
        𝔪𝔦𝔫𝔰𝔱𝔯𝔢𝔱 = 0xb02,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯3 = 0xb03,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯4 = 0xb04,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯5 = 0xb05,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯6 = 0xb06,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯7 = 0xb07,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯8 = 0xb08,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯9 = 0xb09,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯10 = 0xb0a,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯11 = 0xb0b,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯12 = 0xb0c,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯13 = 0xb0d,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯14 = 0xb0e,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯15 = 0xb0f,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯16 = 0xb10,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯17 = 0xb11,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯18 = 0xb12,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯19 = 0xb13,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯20 = 0xb14,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯21 = 0xb15,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯22 = 0xb16,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯23 = 0xb17,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯24 = 0xb18,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯25 = 0xb19,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯26 = 0xb1a,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯27 = 0xb1b,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯28 = 0xb1c,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯29 = 0xb1d,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯30 = 0xb1e,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯31 = 0xb1f,
        𝔪𝔠𝔶𝔠𝔩𝔢𝔥 = 0xb80,
        𝔪𝔦𝔫𝔰𝔱𝔯𝔢𝔱𝔥 = 0xb82,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯3𝔥 = 0xb83,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯4𝔥 = 0xb84,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯5𝔥 = 0xb85,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯6𝔥 = 0xb86,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯7𝔥 = 0xb87,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯8𝔥 = 0xb88,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯9𝔥 = 0xb89,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯10𝔥 = 0xb8a,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯11𝔥 = 0xb8b,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯12𝔥 = 0xb8c,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯13𝔥 = 0xb8d,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯14𝔥 = 0xb8e,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯15𝔥 = 0xb8f,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯16𝔥 = 0xb90,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯17𝔥 = 0xb91,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯18𝔥 = 0xb92,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯19𝔥 = 0xb93,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯20𝔥 = 0xb94,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯21𝔥 = 0xb95,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯22𝔥 = 0xb96,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯23𝔥 = 0xb97,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯24𝔥 = 0xb98,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯25𝔥 = 0xb99,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯26𝔥 = 0xb9a,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯27𝔥 = 0xb9b,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯28𝔥 = 0xb9c,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯29𝔥 = 0xb9d,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯30𝔥 = 0xb9e,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯31𝔥 = 0xb9f,
        𝔠𝔶𝔠𝔩𝔢 = 0xc00,
        𝔱𝔦𝔪𝔢 = 0xc01,
        𝔦𝔫𝔰𝔱𝔯𝔢𝔱 = 0xc02,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯3 = 0xc03,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯4 = 0xc04,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯5 = 0xc05,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯6 = 0xc06,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯7 = 0xc07,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯8 = 0xc08,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯9 = 0xc09,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯10 = 0xc0a,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯11 = 0xc0b,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯12 = 0xc0c,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯13 = 0xc0d,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯14 = 0xc0e,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯15 = 0xc0f,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯16 = 0xc10,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯17 = 0xc11,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯18 = 0xc12,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯19 = 0xc13,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯20 = 0xc14,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯21 = 0xc15,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯22 = 0xc16,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯23 = 0xc17,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯24 = 0xc18,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯25 = 0xc19,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯26 = 0xc1a,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯27 = 0xc1b,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯28 = 0xc1c,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯29 = 0xc1d,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯30 = 0xc1e,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯31 = 0xc1f,
        𝔠𝔶𝔠𝔩𝔢𝔥 = 0xc80,
        𝔱𝔦𝔪𝔢𝔥 = 0xc81,
        𝔦𝔫𝔰𝔱𝔯𝔢𝔱𝔥 = 0xc82,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯3𝔥 = 0xc83,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯4𝔥 = 0xc84,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯5𝔥 = 0xc85,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯6𝔥 = 0xc86,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯7𝔥 = 0xc87,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯8𝔥 = 0xc88,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯9𝔥 = 0xc89,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯10𝔥 = 0xc8a,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯11𝔥 = 0xc8b,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯12𝔥 = 0xc8c,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯13𝔥 = 0xc8d,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯14𝔥 = 0xc8e,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯15𝔥 = 0xc8f,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯16𝔥 = 0xc90,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯17𝔥 = 0xc91,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯18𝔥 = 0xc92,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯19𝔥 = 0xc93,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯20𝔥 = 0xc94,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯21𝔥 = 0xc95,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯22𝔥 = 0xc96,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯23𝔥 = 0xc97,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯24𝔥 = 0xc98,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯25𝔥 = 0xc99,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯26𝔥 = 0xc9a,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯27𝔥 = 0xc9b,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯28𝔥 = 0xc9c,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯29𝔥 = 0xc9d,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯30𝔥 = 0xc9e,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯31𝔥 = 0xc9f,
        𝔥𝔤𝔢𝔦𝔭 = 0xe12,
        𝔪𝔳𝔢𝔫𝔡𝔬𝔯𝔦𝔡 = 0xf11,
        𝔪𝔞𝔯𝔠𝔥𝔦𝔡 = 0xf12,
        𝔪𝔦𝔪𝔭𝔦𝔡 = 0xf13,
        𝔪𝔥𝔞𝔯𝔱𝔦𝔡 = 0xf14,
        𝔪𝔠𝔬𝔫𝔣𝔦𝔤𝔭𝔱𝔯 = 0xf15
    }
    Display: {
        self => {
            let reference = 𝔠𝔰𝔯_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐫𝐯𝟑𝟐_𝔯𝔢𝔣𝔢𝔯𝔢𝔫𝔠𝔢[*self as usize] as usize;
            &𝔠𝔰𝔯_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐫𝐯𝟑𝟐_𝔫𝔞𝔪𝔢𝔰[reference & 0xfff..(reference & 0xfff) + (reference >> 12)]
        }
    }

    [{|value| !(0x001..=0x003).contains(&value) &&
              value != 0x100 &&
              !(0x104..=0x106).contains(&value) &&
              value != 0x10a &&
              !(0x140..=0x144).contains(&value) &&
              value != 0x180 &&
              value != 0x200 &&
              !(0x204..=0x205).contains(&value) &&
              !(0x240..=0x244).contains(&value) &&
              value != 0x280 &&
              !(0x300..=0x306).contains(&value) &&
              value != 0x30a &&
              value != 0x320 &&
              !(0x323..=0x344).contains(&value) &&
              !(0x34a..=0x34b).contains(&value) &&
              !((0x3a0..=0x3ef).contains(&value) && (value & 0xff1 != 0x3a1)) &&
              value != 0x5a8 &&
              value != 0x5a8 &&
              value != 0x600 &&
              !(0x602..=0x607).contains(&value) &&
              value != 0x60a &&
              !(0x643..=0x645).contains(&value) &&
              value != 0x64a &&
              value != 0x747 &&
              !(0x7a0..=0x7a3).contains(&value) &&
              value != 0x7a8 &&
              !(0x7b0..=0x7b3).contains(&value) &&
              value != 0xb00 &&
              !(0xb02..=0xb1f).contains(&value) &&
              !(0xc00..=0xc1f).contains(&value) &&
              value != 0xe12 &&
              !(0xf11..=0xf15).contains(&value)}]
    []
    [   𝐜𝐬𝐫_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐫𝐯𝟑𝟐 {|value| (value & 0xff1 == 0x3a1) ||
                                   (value < 0x7a0) && (value & 0x0b0 == 0x010) ||
                                   (value >= 0x800) && (value & 0x080 == 0x080)}]
    #[derive(Clone, Copy, Debug, Eq, Ord, PartialEq, PartialOrd)]
    #[repr(i16/u16)]
    pub enum 𝐜𝐬𝐫_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐫𝐯𝟔𝟒 {
        𝔣𝔣𝔩𝔞𝔤𝔰 = 0x001,
        𝔣𝔯𝔪 = 0x002,
        𝔣𝔠𝔰𝔯 = 0x003,
        𝔰𝔰𝔱𝔞𝔱𝔲𝔰 = 0x100,
        𝔰𝔦𝔢 = 0x104,
        𝔰𝔱𝔳𝔢𝔠 = 0x105,
        𝔰𝔠𝔬𝔲𝔫𝔱𝔢𝔯𝔢𝔫 = 0x106,
        𝔰𝔢𝔫𝔳𝔠𝔣𝔤 = 0x10a,
        𝔰𝔰𝔠𝔯𝔞𝔱𝔠𝔥 = 0x140,
        𝔰𝔢𝔭𝔠 = 0x141,
        𝔰𝔠𝔞𝔲𝔰𝔢 = 0x142,
        𝔰𝔱𝔳𝔞𝔩 = 0x143,
        𝔰𝔦𝔭 = 0x144,
        𝔰𝔞𝔱𝔭 = 0x180,
        𝔳𝔰𝔰𝔱𝔞𝔱𝔲𝔰 = 0x200,
        𝔳𝔰𝔦𝔢 = 0x204,
        𝔳𝔰𝔱𝔳𝔢𝔠 = 0x205,
        𝔳𝔰𝔰𝔠𝔯𝔞𝔱𝔠𝔥 = 0x240,
        𝔳𝔰𝔢𝔭𝔠 = 0x241,
        𝔳𝔰𝔠𝔞𝔲𝔰𝔢 = 0x242,
        𝔳𝔰𝔱𝔳𝔞𝔩 = 0x243,
        𝔳𝔰𝔦𝔭 = 0x244,
        𝔳𝔰𝔞𝔱𝔭 = 0x280,
        𝔪𝔰𝔱𝔞𝔱𝔲𝔰 = 0x300,
        𝔪𝔦𝔰𝔞 = 0x301,
        𝔪𝔢𝔡𝔢𝔩𝔢𝔤 = 0x302,
        𝔪𝔦𝔡𝔢𝔩𝔢𝔤 = 0x303,
        𝔪𝔦𝔢 = 0x304,
        𝔪𝔱𝔳𝔢𝔠 = 0x305,
        𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯𝔢𝔫 = 0x306,
        𝔪𝔢𝔫𝔳𝔠𝔣𝔤 = 0x30a,
        𝔪𝔠𝔬𝔲𝔫𝔱𝔦𝔫𝔥𝔦𝔟𝔦𝔱 = 0x320,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱3 = 0x323,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱4 = 0x324,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱5 = 0x325,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱6 = 0x326,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱7 = 0x327,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱8 = 0x328,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱9 = 0x329,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱10 = 0x32a,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱11 = 0x32b,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱12 = 0x32c,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱13 = 0x32d,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱14 = 0x32e,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱15 = 0x32f,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱16 = 0x330,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱17 = 0x331,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱18 = 0x332,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱19 = 0x333,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱20 = 0x334,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱21 = 0x335,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱22 = 0x336,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱23 = 0x337,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱24 = 0x338,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱25 = 0x339,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱26 = 0x33a,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱27 = 0x33b,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱28 = 0x33c,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱29 = 0x33d,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱30 = 0x33e,
        𝔪𝔥𝔭𝔪𝔢𝔳𝔢𝔫𝔱31 = 0x33f,
        𝔪𝔰𝔠𝔯𝔞𝔱𝔠𝔥 = 0x340,
        𝔪𝔢𝔭𝔠 = 0x341,
        𝔪𝔠𝔞𝔲𝔰𝔢 = 0x342,
        𝔪𝔱𝔳𝔞𝔩 = 0x343,
        𝔪𝔦𝔭 = 0x344,
        𝔪𝔱𝔦𝔫𝔰𝔱 = 0x34a,
        𝔪𝔱𝔳𝔞𝔩2 = 0x34b,
        𝔭𝔪𝔭𝔠𝔣𝔤0 = 0x3a0,
        𝔭𝔪𝔭𝔠𝔣𝔤2 = 0x3a2,
        𝔭𝔪𝔭𝔠𝔣𝔤4 = 0x3a4,
        𝔭𝔪𝔭𝔠𝔣𝔤6 = 0x3a6,
        𝔭𝔪𝔭𝔠𝔣𝔤8 = 0x3a8,
        𝔭𝔪𝔭𝔠𝔣𝔤10 = 0x3aa,
        𝔭𝔪𝔭𝔠𝔣𝔤12 = 0x3ac,
        𝔭𝔪𝔭𝔠𝔣𝔤14 = 0x3ae,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯0 = 0x3b0,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯1 = 0x3b1,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯2 = 0x3b2,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯3 = 0x3b3,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯4 = 0x3b4,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯5 = 0x3b5,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯6 = 0x3b6,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯7 = 0x3b7,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯8 = 0x3b8,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯9 = 0x3b9,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯10 = 0x3ba,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯11 = 0x3bb,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯12 = 0x3bc,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯13 = 0x3bd,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯14 = 0x3be,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯15 = 0x3bf,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯16 = 0x3c0,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯17 = 0x3c1,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯18 = 0x3c2,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯19 = 0x3c3,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯20 = 0x3c4,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯21 = 0x3c5,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯22 = 0x3c6,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯23 = 0x3c7,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯24 = 0x3c8,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯25 = 0x3c9,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯26 = 0x3ca,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯27 = 0x3cb,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯28 = 0x3cc,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯29 = 0x3cd,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯30 = 0x3ce,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯31 = 0x3cf,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯32 = 0x3d0,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯33 = 0x3d1,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯34 = 0x3d2,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯35 = 0x3d3,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯36 = 0x3d4,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯37 = 0x3d5,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯38 = 0x3d6,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯39 = 0x3d7,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯40 = 0x3d8,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯41 = 0x3d9,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯42 = 0x3da,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯43 = 0x3db,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯44 = 0x3dc,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯45 = 0x3dd,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯46 = 0x3de,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯47 = 0x3df,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯48 = 0x3e0,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯49 = 0x3e1,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯50 = 0x3e2,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯51 = 0x3e3,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯52 = 0x3e4,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯53 = 0x3e5,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯54 = 0x3e6,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯55 = 0x3e7,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯56 = 0x3e8,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯57 = 0x3e9,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯58 = 0x3ea,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯59 = 0x3eb,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯60 = 0x3ec,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯61 = 0x3ed,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯62 = 0x3ee,
        𝔭𝔪𝔭𝔞𝔡𝔡𝔯63 = 0x3ef,
        𝔰𝔠𝔬𝔫𝔱𝔢𝔵𝔱 = 0x5a8,
        𝔥𝔰𝔱𝔞𝔱𝔲𝔰 = 0x600,
        𝔥𝔢𝔡𝔢𝔩𝔢𝔤 = 0x602,
        𝔥𝔦𝔡𝔢𝔩𝔢𝔤 = 0x603,
        𝔥𝔦𝔢 = 0x604,
        𝔥𝔱𝔦𝔪𝔢𝔡𝔢𝔩𝔱𝔞 = 0x605,
        𝔥𝔠𝔬𝔲𝔫𝔱𝔢𝔯𝔢𝔫 = 0x606,
        𝔥𝔤𝔢𝔦𝔢 = 0x607,
        𝔥𝔢𝔫𝔳𝔠𝔣𝔤 = 0x60a,
        𝔥𝔱𝔳𝔞𝔩 = 0x643,
        𝔥𝔦𝔭 = 0x644,
        𝔥𝔳𝔦𝔭 = 0x645,
        𝔥𝔱𝔦𝔫𝔰𝔱 = 0x64a,
        𝔪𝔰𝔢𝔠𝔠𝔣𝔤 = 0x747,
        𝔱𝔰𝔢𝔩𝔢𝔠𝔱 = 0x7a0,
        𝔱𝔡𝔞𝔱𝔞1 = 0x7a1,
        𝔱𝔡𝔞𝔱𝔞2 = 0x7a2,
        𝔱𝔡𝔞𝔱𝔞3 = 0x7a3,
        𝔪𝔠𝔬𝔫𝔱𝔢𝔵𝔱 = 0x7a8,
        𝔡𝔠𝔰𝔯 = 0x7b0,
        𝔡𝔭𝔠 = 0x7b1,
        𝔡𝔰𝔠𝔯𝔞𝔱𝔠𝔥0 = 0x7b2,
        𝔡𝔰𝔠𝔯𝔞𝔱𝔠𝔥1 = 0x7b3,
        𝔪𝔠𝔶𝔠𝔩𝔢 = 0xb00,
        𝔪𝔦𝔫𝔰𝔱𝔯𝔢𝔱 = 0xb02,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯3 = 0xb03,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯4 = 0xb04,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯5 = 0xb05,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯6 = 0xb06,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯7 = 0xb07,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯8 = 0xb08,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯9 = 0xb09,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯10 = 0xb0a,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯11 = 0xb0b,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯12 = 0xb0c,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯13 = 0xb0d,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯14 = 0xb0e,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯15 = 0xb0f,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯16 = 0xb10,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯17 = 0xb11,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯18 = 0xb12,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯19 = 0xb13,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯20 = 0xb14,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯21 = 0xb15,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯22 = 0xb16,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯23 = 0xb17,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯24 = 0xb18,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯25 = 0xb19,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯26 = 0xb1a,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯27 = 0xb1b,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯28 = 0xb1c,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯29 = 0xb1d,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯30 = 0xb1e,
        𝔪𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯31 = 0xb1f,
        𝔠𝔶𝔠𝔩𝔢 = 0xc00,
        𝔱𝔦𝔪𝔢 = 0xc01,
        𝔦𝔫𝔰𝔱𝔯𝔢𝔱 = 0xc02,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯3 = 0xc03,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯4 = 0xc04,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯5 = 0xc05,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯6 = 0xc06,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯7 = 0xc07,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯8 = 0xc08,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯9 = 0xc09,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯10 = 0xc0a,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯11 = 0xc0b,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯12 = 0xc0c,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯13 = 0xc0d,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯14 = 0xc0e,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯15 = 0xc0f,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯16 = 0xc10,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯17 = 0xc11,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯18 = 0xc12,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯19 = 0xc13,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯20 = 0xc14,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯21 = 0xc15,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯22 = 0xc16,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯23 = 0xc17,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯24 = 0xc18,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯25 = 0xc19,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯26 = 0xc1a,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯27 = 0xc1b,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯28 = 0xc1c,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯29 = 0xc1d,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯30 = 0xc1e,
        𝔥𝔭𝔪𝔠𝔬𝔲𝔫𝔱𝔢𝔯31 = 0xc1f,
        𝔥𝔤𝔢𝔦𝔭 = 0xe12,
        𝔪𝔳𝔢𝔫𝔡𝔬𝔯𝔦𝔡 = 0xf11,
        𝔪𝔞𝔯𝔠𝔥𝔦𝔡 = 0xf12,
        𝔪𝔦𝔪𝔭𝔦𝔡 = 0xf13,
        𝔪𝔥𝔞𝔯𝔱𝔦𝔡 = 0xf14,
        𝔪𝔠𝔬𝔫𝔣𝔦𝔤𝔭𝔱𝔯 = 0xf15
    }
    Display: {
        self => {
            let reference = 𝔠𝔰𝔯_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐫𝐯𝟔𝟒_𝔯𝔢𝔣𝔢𝔯𝔢𝔫𝔠𝔢[*self as usize] as usize;
            &𝔠𝔰𝔯_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐫𝐯𝟔𝟒_𝔫𝔞𝔪𝔢𝔰[reference & 0xfff..(reference & 0xfff) + (reference >> 12)]
        }
    }
}

#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝐫𝐯𝟑𝟐𝐞_𝔫𝔞𝔪𝔢𝔰: [u8; 64] = *b"x0\x00\x00x1\x00\x00x2\x00\x00x3\x00\x00x4\x00\x00x5\x00\x00x6\x00\x00x7\x00\x00x8\x00\x00x9\x00\x00x10\x00x11\x00x12\x00x13\x00x14\x00x15\x00";
#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝔫𝔞𝔪𝔢𝔰: [u8; 128] = *b"x0\x00\x00x1\x00\x00x2\x00\x00x3\x00\x00x4\x00\x00x5\x00\x00x6\x00\x00x7\x00\x00x8\x00\x00x9\x00\x00x10\x00x11\x00x12\x00x13\x00x14\x00x15\x00x16\x00x17\x00x18\x00x19\x00x20\x00x21\x00x22\x00x23\x00x24\x00x25\x00x26\x00x27\x00x28\x00x29\x00x30\x00x31\x00";
#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞_𝔫𝔞𝔪𝔢𝔰: [u8; 32] = *b"\x00\x00raspgptpt0s3s4s0s1a0a1a2a3s2t1";
#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐞𝐚𝐛𝐢_𝔫𝔞𝔪𝔢𝔰: [u8; 128] = *b"zerora\x00\x00sp\x00\x00gp\x00\x00tp\x00\x00t0\x00\x00s3\x00\x00s4\x00\x00s0\x00\x00s1\x00\x00a0\x00\x00a1\x00\x00a2\x00\x00a3\x00\x00s2\x00\x00t1\x00\x00s5\x00\x00s6\x00\x00s7\x00\x00s8\x00\x00s9\x00\x00s10\x00s11\x00s12\x00s13\x00s14\x00s15\x00s16\x00s17\x00s18\x00s19\x00s20\x00";
#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔤𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐮𝐚𝐛𝐢_𝔫𝔞𝔪𝔢𝔰: [u8; 128] = *b"zerora\x00\x00sp\x00\x00gp\x00\x00tp\x00\x00t0\x00\x00t1\x00\x00t2\x00\x00s0\x00\x00s1\x00\x00a0\x00\x00a1\x00\x00a2\x00\x00a3\x00\x00a4\x00\x00a5\x00\x00a6\x00\x00a7\x00\x00s2\x00\x00s3\x00\x00s4\x00\x00s5\x00\x00s6\x00\x00s7\x00\x00s8\x00\x00s9\x00\x00s10\x00s11\x00t3\x00\x00t4\x00\x00t5\x00\x00t6\x00\x00";

#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔣𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔫𝔲𝔪𝔢𝔯𝔦𝔠_𝔫𝔞𝔪𝔢𝔰: [u8; 128] = *b"f0\x00\x00f1\x00\x00f2\x00\x00f3\x00\x00f4\x00\x00f5\x00\x00f6\x00\x00f7\x00\x00f8\x00\x00f9\x00\x00f10\x00f11\x00f12\x00f13\x00f14\x00f15\x00f16\x00f17\x00f18\x00f19\x00f20\x00f21\x00f22\x00f23\x00f24\x00f25\x00f26\x00f27\x00f28\x00f29\x00f30\x00f31\x00";
#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔣𝔭_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝔞𝔟𝔦_𝔫𝔞𝔪𝔢𝔰: [u8; 128] = *b"ft0\x00ft1\x00ft2\x00ft3\x00ft4\x00ft5\x00ft6\x00ft7\x00fs0\x00fs1\x00fa0\x00fa1\x00fa2\x00fa3\x00fa4\x00fa5\x00fa6\x00fa7\x00fs2\x00fs3\x00fs4\x00fs5\x00fs6\x00fs7\x00fs8\x00fs9\x00fs10fs11ft8\x00ft9\x00ft10ft11";

#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔯𝔬𝔲𝔫𝔡𝔦𝔫𝔤_𝔪𝔬𝔡𝔢_𝔫𝔞𝔪𝔢: [u8; 32] = *b"rne\x00rtz\x00rdn\x00rup\x00rmm\x00\x00\x00\x00\x00\x00\x00\x00\x00dyn\x00";

#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔣𝔢𝔫𝔠𝔢_𝔫𝔞𝔪𝔢𝔰: [u8; 64] = *b"\x00\x00\x00\x00w\x00\x00\x00r\x00\x00\x00rw\x00\x00o\x00\x00\x00ow\x00\x00or\x00\x00orw\x00i\x00\x00\x00iw\x00\x00ir\x00\x00irw\x00io\x00\x00iow\x00ior\x00iorw";

#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔠𝔰𝔯_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐫𝐯𝟑𝟐_𝔯𝔢𝔣𝔢𝔯𝔢𝔫𝔠𝔢: [u16; 0x1000] = [0, 0x662c, 0x36b0, 0x4695, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x7599, 0, 0, 0, 0x36a6, 0x5669, 0xa2f3, 0, 0, 0, 0x7617, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x8508, 0x468d, 0x6626, 0x5663, 0x36aa, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x4688, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x8598, 0, 0, 0, 0x46a5, 0x6668, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x9507, 0x568c, 0x7625, 0x6662, 0x46a9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x5687, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x7538, 0x46a1, 0x75c3, 0x75d1, 0x36b9, 0x567d, 0xa2ad, 0, 0, 0, 0x7520, 0, 0, 0, 0, 0, 0x8538, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x8520, 0, 0, 0, 0, 0, 0xd134, 0, 0, 0xa283, 0xa2b7, 0xa2c1, 0xa2cb, 0xa2d5, 0xa2df, 0xa2e9, 0xb1a7, 0xb1b2, 0xb1bd, 0xb1c8, 0xb1d3, 0xb1de, 0xb1e9, 0xb1f4, 0xb1ff, 0xb20a, 0xb215, 0xb220, 0xb22b, 0xb236, 0xb241, 0xb24c, 0xb257, 0xb262, 0xb26d, 0xb278, 0xb283, 0xb28e, 0x8528, 0x469d, 0x6638, 0x564a, 0x36bc, 0, 0, 0, 0, 0, 0x6644, 0x664a, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x75d8, 0x7560, 0x75df, 0x75e6, 0x75ed, 0x75f4, 0x75fb, 0x7602, 0x7609, 0x7610, 0x8560, 0x8568, 0x8570, 0x8578, 0x8580, 0x8588, 0x8540, 0x8321, 0x837b, 0x83d5, 0x842f, 0x8489, 0x84e3, 0x8548, 0x8550, 0x8558, 0x9321, 0x932a, 0x9333, 0x933c, 0x9345, 0x934e, 0x9357, 0x9360, 0x9369, 0x9372, 0x937b, 0x9384, 0x938d, 0x9396, 0x939f, 0x93a8, 0x93b1, 0x93ba, 0x93c3, 0x93cc, 0x93d5, 0x93de, 0x93e7, 0x93f0, 0x93f9, 0x9402, 0x940b, 0x9414, 0x941d, 0x9426, 0x942f, 0x9438, 0x9441, 0x944a, 0x9453, 0x945c, 0x9465, 0x946e, 0x9477, 0x9480, 0x9489, 0x9492, 0x949b, 0x94a4, 0x94ad, 0x94b6, 0x94bf, 0x94c8, 0x94d1, 0x94da, 0x94e3, 0x94ec, 0x94f5, 0x94fe, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x8590, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x75ae, 0, 0x75a0, 0x75a7, 0x36b3, 0xa19c, 0xa299, 0x566e, 0, 0, 0x7510, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0xb19c, 0, 0, 0, 0, 0x8510, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x5678, 0x36b6, 0x4699, 0, 0, 0, 0, 0x6632, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x7530, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x8530, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x761e, 0x6650, 0x6656, 0x665c, 0, 0, 0, 0, 0x8518, 0, 0, 0, 0, 0, 0, 0, 0x4691, 0x36ad, 0x92fd, 0x9306, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x65bc, 0, 0x830f, 0xc118, 0xc14e, 0xc15b, 0xc168, 0xc175, 0xc182, 0xc18f, 0xd000, 0xd00e, 0xd01c, 0xd02a, 0xd038, 0xd046, 0xd054, 0xd062, 0xd070, 0xd07e, 0xd08c, 0xd09a, 0xd0a8, 0xd0b6, 0xd0c4, 0xd0d2, 0xd0e0, 0xd0ee, 0xd0fc, 0xd10a, 0xd118, 0xd126, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x75bc, 0, 0x930f, 0xd141, 0xd14e, 0xd15b, 0xd168, 0xd175, 0xd182, 0xd18f, 0xe000, 0xe00e, 0xe01c, 0xe02a, 0xe038, 0xe046, 0xe054, 0xe062, 0xe070, 0xe07e, 0xe08c, 0xe09a, 0xe0a8, 0xe0b6, 0xe0c4, 0xe0d2, 0xe0e0, 0xe0ee, 0xe0fc, 0xe10a, 0xe118, 0xe126, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x55bd, 0x419d, 0x7310, 0xb119, 0xb14f, 0xb15c, 0xb169, 0xb176, 0xb183, 0xb190, 0xc001, 0xc00f, 0xc01d, 0xc02b, 0xc039, 0xc047, 0xc055, 0xc063, 0xc071, 0xc07f, 0xc08d, 0xc09b, 0xc0a9, 0xc0b7, 0xc0c5, 0xc0d3, 0xc0e1, 0xc0ef, 0xc0fd, 0xc10b, 0xc119, 0xc127, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x65bd, 0x5682, 0x8310, 0xc142, 0xc14f, 0xc15c, 0xc169, 0xc176, 0xc183, 0xc190, 0xd001, 0xd00f, 0xd01d, 0xd02b, 0xd039, 0xd047, 0xd055, 0xd063, 0xd071, 0xd07f, 0xd08d, 0xd09b, 0xd0a9, 0xd0b7, 0xd0c5, 0xd0d3, 0xd0e1, 0xd0ef, 0xd0fd, 0xd10b, 0xd119, 0xd127, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x5673, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x9318, 0x75b5, 0x663e, 0x75ca, 0xa2a3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0];
#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔠𝔰𝔯_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐫𝐯𝟑𝟐_𝔫𝔞𝔪𝔢𝔰: [u8; 1727] = *b"mhpmcounter10hmhpmcounter11hmhpmcounter12hmhpmcounter13hmhpmcounter14hmhpmcounter15hmhpmcounter16hmhpmcounter17hmhpmcounter18hmhpmcounter19hmhpmcounter20hmhpmcounter21hmhpmcounter22hmhpmcounter23hmhpmcounter24hmhpmcounter25hmhpmcounter26hmhpmcounter27hmhpmcounter28hmhpmcounter29hmhpmcounter30hmhpmcounter31hmcountinhibitmhpmcounter3hmhpmcounter4hmhpmcounter5hmhpmcounter6hmhpmcounter7hmhpmcounter8hmhpmcounter9hhtimedeltahmhpmevent10mhpmevent11mhpmevent12mhpmevent13mhpmevent14mhpmevent15mhpmevent16mhpmevent17mhpmevent18mhpmevent19mhpmevent20mhpmevent21mhpmevent22mhpmevent23mhpmevent24mhpmevent25mhpmevent26mhpmevent27mhpmevent28mhpmevent29mhpmevent30mhpmevent31hcounterenmconfigptrmcounterenmhpmevent4mhpmevent5mhpmevent6mhpmevent7mhpmevent8mhpmevent9scounterendscratch0dscratch1minstrethmvendoridpmpaddr10pmpaddr11pmpaddr12pmpaddr13pmpaddr14pmpaddr15pmpaddr16pmpaddr17pmpaddr18pmpaddr19pmpaddr20pmpaddr21pmpaddr22pmpaddr23pmpaddr24pmpaddr25pmpaddr26pmpaddr27pmpaddr28pmpaddr29pmpaddr30pmpaddr31pmpaddr32pmpaddr33pmpaddr34pmpaddr35pmpaddr36pmpaddr37pmpaddr38pmpaddr39pmpaddr40pmpaddr41pmpaddr42pmpaddr43pmpaddr44pmpaddr45pmpaddr46pmpaddr47pmpaddr48pmpaddr49pmpaddr50pmpaddr51pmpaddr52pmpaddr53pmpaddr54pmpaddr55pmpaddr56pmpaddr57pmpaddr58pmpaddr59pmpaddr60pmpaddr61pmpaddr62pmpaddr63vsscratchhenvcfghmcontextmenvcfghmscratchmseccfghmstatushpmpaddr0pmpaddr7pmpaddr8pmpaddr9pmpcfg10pmpcfg11pmpcfg12pmpcfg13pmpcfg14pmpcfg15scontextvsstatushedeleghideleghstatusmarchidmcyclehmedelegmhartidmidelegpmpcfg0pmpcfg2pmpcfg3pmpcfg4pmpcfg5pmpcfg6pmpcfg7pmpcfg8pmpcfg9senvcfgtselectvscausefflagshtinstmcausemimpidmtinstmtval2tdata1tdata2tdata3vstvalvstvechgeiehgeiphtvalmtvectimehvsatpvsepcdcsrfcsrhvipmepcmisavsievsipdpcfrmhiehipmiemip";
#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔠𝔰𝔯_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐫𝐯𝟔𝟒_𝔯𝔢𝔣𝔢𝔯𝔢𝔫𝔠𝔢: [u16; 0x1000] = [0, 0x65c2, 0x3647, 0x462c, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x7536, 0, 0, 0, 0x363d, 0x5605, 0xa2c9, 0, 0, 0, 0x75ad, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x84d5, 0x4624, 0x65bc, 0x55ff, 0x3641, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x461f, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x8535, 0, 0, 0, 0x463c, 0x6604, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x94d4, 0x5623, 0x75bb, 0x65fe, 0x4640, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x561e, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x7583, 0x4638, 0x7560, 0x7575, 0x3650, 0x5619, 0xa283, 0, 0, 0, 0x7567, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0xd000, 0, 0, 0xa24f, 0xa28d, 0xa297, 0xa2a1, 0xa2ab, 0xa2b5, 0xa2bf, 0xb173, 0xb17e, 0xb189, 0xb194, 0xb19f, 0xb1aa, 0xb1b5, 0xb1c0, 0xb1cb, 0xb1d6, 0xb1e1, 0xb1ec, 0xb1f7, 0xb202, 0xb20d, 0xb218, 0xb223, 0xb22e, 0xb239, 0xb244, 0xb24f, 0xb25a, 0x84ed, 0x4634, 0x65ce, 0x55e6, 0x3653, 0, 0, 0, 0, 0, 0x65e0, 0x65e6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x758a, 0, 0x7591, 0, 0x7598, 0, 0x759f, 0, 0x75a6, 0, 0x8515, 0, 0x851d, 0, 0x8525, 0, 0x84f5, 0x82ee, 0x8348, 0x83a2, 0x83fc, 0x8456, 0x84b0, 0x84fd, 0x8505, 0x850d, 0x92ee, 0x92f7, 0x9300, 0x9309, 0x9312, 0x931b, 0x9324, 0x932d, 0x9336, 0x933f, 0x9348, 0x9351, 0x935a, 0x9363, 0x936c, 0x9375, 0x937e, 0x9387, 0x9390, 0x9399, 0x93a2, 0x93ab, 0x93b4, 0x93bd, 0x93c6, 0x93cf, 0x93d8, 0x93e1, 0x93ea, 0x93f3, 0x93fc, 0x9405, 0x940e, 0x9417, 0x9420, 0x9429, 0x9432, 0x943b, 0x9444, 0x944d, 0x9456, 0x945f, 0x9468, 0x9471, 0x947a, 0x9483, 0x948c, 0x9495, 0x949e, 0x94a7, 0x94b0, 0x94b9, 0x94c2, 0x94cb, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x852d, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x7552, 0, 0x753d, 0x754b, 0x364a, 0xa26f, 0xa265, 0x560a, 0, 0, 0x7544, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x5614, 0x364d, 0x4630, 0, 0, 0, 0, 0x65c8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x757c, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x75b4, 0x65ec, 0x65f2, 0x65f8, 0, 0, 0, 0, 0x84dd, 0, 0, 0, 0, 0, 0, 0, 0x4628, 0x3644, 0x92d3, 0x92dc, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x65d4, 0, 0x84e5, 0xc111, 0xc12b, 0xc137, 0xc143, 0xc14f, 0xc15b, 0xc167, 0xd00d, 0xd01a, 0xd027, 0xd034, 0xd041, 0xd04e, 0xd05b, 0xd068, 0xd075, 0xd082, 0xd08f, 0xd09c, 0xd0a9, 0xd0b6, 0xd0c3, 0xd0d0, 0xd0dd, 0xd0ea, 0xd0f7, 0xd104, 0xd111, 0xd11e, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x55d5, 0x4270, 0x74e6, 0xb112, 0xb12c, 0xb138, 0xb144, 0xb150, 0xb15c, 0xb168, 0xc00e, 0xc01b, 0xc028, 0xc035, 0xc042, 0xc04f, 0xc05c, 0xc069, 0xc076, 0xc083, 0xc090, 0xc09d, 0xc0aa, 0xc0b7, 0xc0c4, 0xc0d1, 0xc0de, 0xc0eb, 0xc0f8, 0xc105, 0xc112, 0xc11f, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x560f, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0x92e5, 0x7559, 0x65da, 0x756e, 0xa279, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0];
#[allow(non_upper_case_globals)]
#[cfg(feature = "std")]
const 𝔠𝔰𝔯_𝔯𝔢𝔤𝔦𝔰𝔱𝔢𝔯_𝐫𝐯𝟔𝟒_𝔫𝔞𝔪𝔢𝔰: [u8; 1622] = *b"mcountinhibitmhpmcounter10mhpmcounter11mhpmcounter12mhpmcounter13mhpmcounter14mhpmcounter15mhpmcounter16mhpmcounter17mhpmcounter18mhpmcounter19mhpmcounter20mhpmcounter21mhpmcounter22mhpmcounter23mhpmcounter24mhpmcounter25mhpmcounter26mhpmcounter27mhpmcounter28mhpmcounter29mhpmcounter30mhpmcounter31mhpmcounter4mhpmcounter5mhpmcounter6mhpmcounter7mhpmcounter8mhpmcounter9mhpmevent10mhpmevent11mhpmevent12mhpmevent13mhpmevent14mhpmevent15mhpmevent16mhpmevent17mhpmevent18mhpmevent19mhpmevent20mhpmevent21mhpmevent22mhpmevent23mhpmevent24mhpmevent25mhpmevent26mhpmevent27mhpmevent28mhpmevent29mhpmevent30mhpmevent31hcounterenhtimedeltamconfigptrmcounterenmhpmevent4mhpmevent5mhpmevent6mhpmevent7mhpmevent8mhpmevent9scounterendscratch0dscratch1mvendoridpmpaddr10pmpaddr11pmpaddr12pmpaddr13pmpaddr14pmpaddr15pmpaddr16pmpaddr17pmpaddr18pmpaddr19pmpaddr20pmpaddr21pmpaddr22pmpaddr23pmpaddr24pmpaddr25pmpaddr26pmpaddr27pmpaddr28pmpaddr29pmpaddr30pmpaddr31pmpaddr32pmpaddr33pmpaddr34pmpaddr35pmpaddr36pmpaddr37pmpaddr38pmpaddr39pmpaddr40pmpaddr41pmpaddr42pmpaddr43pmpaddr44pmpaddr45pmpaddr46pmpaddr47pmpaddr48pmpaddr49pmpaddr50pmpaddr51pmpaddr52pmpaddr53pmpaddr54pmpaddr55pmpaddr56pmpaddr57pmpaddr58pmpaddr59pmpaddr60pmpaddr61pmpaddr62pmpaddr63vsscratchmcontextminstretmscratchpmpaddr0pmpaddr7pmpaddr8pmpaddr9pmpcfg10pmpcfg12pmpcfg14scontextvsstatushedeleghenvcfghideleghstatusmarchidmedelegmenvcfgmhartidmidelegmseccfgmstatuspmpcfg0pmpcfg2pmpcfg4pmpcfg6pmpcfg8senvcfgtselectvscausefflagshtinstmcausemcyclemimpidmtinstmtval2tdata1tdata2tdata3vstvalvstvechgeiehgeiphtvalmtvecvsatpvsepcdcsrfcsrhvipmepcmisavsievsipdpcfrmhiehipmiemip";

macro_rules! 𝖉𝖊𝖋𝖎𝖓𝖊_𝖉𝖊𝖋𝖆𝖚𝖑𝖙_𝖋𝖔𝖗_𝖗𝖊𝖌𝖎𝖘𝖙𝖊𝖗 {
    ($($𝓻𝓮𝓰𝓲𝓼𝓽𝓮𝓻_𝓽𝔂𝓹𝓮_𝓷𝓪𝓶𝓮:ident::$𝓻𝓮𝓰𝓲𝓼𝓽𝓮𝓻_𝔃𝓮𝓻𝓸_𝓷𝓪𝓶𝓮:ident),*) => {
        $(
            impl Default for $𝓻𝓮𝓰𝓲𝓼𝓽𝓮𝓻_𝓽𝔂𝓹𝓮_𝓷𝓪𝓶𝓮 {
                #[inline(always)]
                fn default() -> $𝓻𝓮𝓰𝓲𝓼𝓽𝓮𝓻_𝓽𝔂𝓹𝓮_𝓷𝓪𝓶𝓮 {
                    $𝓻𝓮𝓰𝓲𝓼𝓽𝓮𝓻_𝓽𝔂𝓹𝓮_𝓷𝓪𝓶𝓮::$𝓻𝓮𝓰𝓲𝓼𝓽𝓮𝓻_𝔃𝓮𝓻𝓸_𝓷𝓪𝓶𝓮
                }
            }
         )*
    }
}

𝖉𝖊𝖋𝖎𝖓𝖊_𝖉𝖊𝖋𝖆𝖚𝖑𝖙_𝖋𝖔𝖗_𝖗𝖊𝖌𝖎𝖘𝖙𝖊𝖗! {
    𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜_𝐫𝐯𝟑𝟐𝐞::𝔵0,
    𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐧𝐮𝐦𝐞𝐫𝐢𝐜::𝔵0,
    𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢_𝐫𝐯𝟑𝟐𝐞::𝔷𝔢𝔯𝔬,
    𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐞𝐚𝐛𝐢::𝔷𝔢𝔯𝔬,
    𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_𝐮𝐚𝐛𝐢::𝔷𝔢𝔯𝔬
}
