/*
 * Permission is hereby granted, free of charge, to any human obtaining a copy of this software and associated documentation files
 * (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify,
 * merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit humans to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE
 * LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

use yace_codegen::𝖋𝖎𝖑𝖙𝖊𝖗_𝖝𝟴𝟲_𝖒𝖆𝖗𝖐𝖊𝖗𝖘;
use yace_codegen::𝖉𝖊𝖋𝖎𝖓𝖊_𝖆𝖘𝖘𝖊𝖒𝖇𝖑𝖊𝖗_𝖎𝖓𝖘𝖙𝖗𝖚𝖈𝖙𝖎𝖔𝖓𝖘;

𝖉𝖊𝖋𝖎𝖓𝖊_𝖆𝖘𝖘𝖊𝖒𝖇𝖑𝖊𝖗_𝖙𝖗𝖆𝖎𝖙! {
    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32]
    pub trait 𝑪𝑷𝑼 {
    }

    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32 ₓ𝔦𝔷]
    pub trait 𝑪𝑷𝑼_𝒘𝒊𝒕𝒉_𝒓𝒊𝒛 {
    }

    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32 ₐᵥₓ512]
    pub trait 𝑪𝑷𝑼_ₐᵥₓ512 {
    }

    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32 ₓ𝔦𝔷 ₐᵥₓ512]
    pub trait 𝑪𝑷𝑼_𝒘𝒊𝒕𝒉_𝒓𝒊𝒛_ₐᵥₓ512 {
    }
}

𝖉𝖊𝖋𝖎𝖓𝖊_𝖆𝖘𝖘𝖊𝖒𝖇𝖑𝖊𝖗_𝖘𝖙𝖗𝖚𝖈𝖙! {
    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32]
    pub struct 𝐛𝐚𝐬𝐢𝐜_𝐚𝐬𝐬𝐞𝐦𝐛𝐥𝐞𝐫_𝔞𝔡𝔡𝔯64_𝔡𝔞𝔱𝔞32[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮: 𝒃𝒚𝒕𝒆_𝒆𝒎𝒊𝒕𝒕𝒆𝒓>]
    as 𝑪𝑷𝑼 {
    }

    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32 ₐᵥₓ512]
    pub struct 𝐛𝐚𝐬𝐢𝐜_𝐚𝐬𝐬𝐞𝐦𝐛𝐥𝐞𝐫_𝔞𝔡𝔡𝔯64_𝔡𝔞𝔱𝔞32_ₐᵥₓ512[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮: 𝒃𝒚𝒕𝒆_𝒆𝒎𝒊𝒕𝒕𝒆𝒓>]
    as 𝑪𝑷𝑼_ₐᵥₓ512 {
    }

    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32 ₓ𝔦𝔷]
    pub struct 𝐛𝐚𝐬𝐢𝐜_𝐚𝐬𝐬𝐞𝐦𝐛𝐥𝐞𝐫_𝔞𝔡𝔡𝔯64_𝐰𝐢𝐭𝐡_𝐫𝐢𝐳_𝔡𝔞𝔱𝔞32[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮: 𝒃𝒚𝒕𝒆_𝒆𝒎𝒊𝒕𝒕𝒆𝒓>]
    as 𝑪𝑷𝑼 {
    }

    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32 ₓ𝔦𝔷 ₓ𝔦𝔷]
    impl[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮: 𝒃𝒚𝒕𝒆_𝒆𝒎𝒊𝒕𝒕𝒆𝒓>] 𝑪𝑷𝑼_𝒘𝒊𝒕𝒉_𝒓𝒊𝒛
    for 𝐛𝐚𝐬𝐢𝐜_𝐚𝐬𝐬𝐞𝐦𝐛𝐥𝐞𝐫_𝔞𝔡𝔡𝔯64_𝐰𝐢𝐭𝐡_𝐫𝐢𝐳_𝔡𝔞𝔱𝔞32[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮>];

    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32 ₓ𝔦𝔷 ₐᵥₓ512]
    pub struct 𝐛𝐚𝐬𝐢𝐜_𝐚𝐬𝐬𝐞𝐦𝐛𝐥𝐞𝐫_𝔞𝔡𝔡𝔯64_𝐰𝐢𝐭𝐡_𝐫𝐢𝐳_𝔡𝔞𝔱𝔞32_ₐᵥₓ512[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮: 𝒃𝒚𝒕𝒆_𝒆𝒎𝒊𝒕𝒕𝒆𝒓>]
    as 𝑪𝑷𝑼_ₐᵥₓ512 {
    }

    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32 ₓ𝔦𝔷 ₓ𝔦𝔷 ₐᵥₓ512]
    impl[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮: 𝒃𝒚𝒕𝒆_𝒆𝒎𝒊𝒕𝒕𝒆𝒓>] 𝑪𝑷𝑼_𝒘𝒊𝒕𝒉_𝒓𝒊𝒛_ₐᵥₓ512
    for 𝐛𝐚𝐬𝐢𝐜_𝐚𝐬𝐬𝐞𝐦𝐛𝐥𝐞𝐫_𝔞𝔡𝔡𝔯64_𝐰𝐢𝐭𝐡_𝐫𝐢𝐳_𝔡𝔞𝔱𝔞32_ₐᵥₓ512[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮>];
}

𝖉𝖊𝖋𝖎𝖓𝖊_𝖆𝖘𝖘𝖊𝖒𝖇𝖑𝖊𝖗_𝖘𝖚𝖕𝖕𝖑𝖊𝖒𝖊𝖓𝖙𝖆𝖗𝖞_𝖙𝖗𝖆𝖎𝖙𝖘! {
    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32]
    impl[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮: 𝒃𝒚𝒕𝒆_𝒆𝒎𝒊𝒕𝒕𝒆𝒓>] for 𝐛𝐚𝐬𝐢𝐜_𝐚𝐬𝐬𝐞𝐦𝐛𝐥𝐞𝐫_𝔞𝔡𝔡𝔯64_𝔡𝔞𝔱𝔞32
    as 𝑪𝑷𝑼;

    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32 ₐᵥₓ512]
    impl[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮: 𝒃𝒚𝒕𝒆_𝒆𝒎𝒊𝒕𝒕𝒆𝒓>] for 𝐛𝐚𝐬𝐢𝐜_𝐚𝐬𝐬𝐞𝐦𝐛𝐥𝐞𝐫_𝔞𝔡𝔡𝔯64_𝔡𝔞𝔱𝔞32_ₐᵥₓ512
    as 𝑪𝑷𝑼_ₐᵥₓ512;

    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32 ₓ𝔦𝔷]
    impl[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮: 𝒃𝒚𝒕𝒆_𝒆𝒎𝒊𝒕𝒕𝒆𝒓>] for 𝐛𝐚𝐬𝐢𝐜_𝐚𝐬𝐬𝐞𝐦𝐛𝐥𝐞𝐫_𝔞𝔡𝔡𝔯64_𝐰𝐢𝐭𝐡_𝐫𝐢𝐳_𝔡𝔞𝔱𝔞32
    as 𝑪𝑷𝑼;

    [𝔞𝔡𝔡𝔯64 𝔡𝔞𝔱𝔞32 ₓ𝔦𝔷 ₐᵥₓ512]
    impl[<'ᵉᵐⁱᵗᵗᵉʳ_ˡⁱᶠᵉᵗⁱᵐᵉ, 𝓮𝓶𝓲𝓽𝓽𝓮𝓻_𝓽𝔂𝓹𝓮: 𝒃𝒚𝒕𝒆_𝒆𝒎𝒊𝒕𝒕𝒆𝒓>] for 𝐛𝐚𝐬𝐢𝐜_𝐚𝐬𝐬𝐞𝐦𝐛𝐥𝐞𝐫_𝔞𝔡𝔡𝔯64_𝐰𝐢𝐭𝐡_𝐫𝐢𝐳_𝔡𝔞𝔱𝔞32_ₐᵥₓ512
    as 𝑪𝑷𝑼_𝒘𝒊𝒕𝒉_𝒓𝒊𝒛_ₐᵥₓ512;
}

pub use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝔞𝔟𝔰𝔬𝔩𝔲𝔱𝔢_𝔞𝔡𝔡𝔯𝔢𝔰𝔰;
pub use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝔞𝔡𝔡𝔯𝔢𝔰𝔰_32ᵇⁱᵗ;
pub use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝔞𝔡𝔡𝔯𝔢𝔰𝔰_64ᵇⁱᵗ;
pub use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝔤𝔞𝔱𝔥𝔢𝔯_𝔞𝔡𝔡𝔯𝔢𝔰𝔰_32ᵇⁱᵗ;
pub use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝔤𝔞𝔱𝔥𝔢𝔯_𝔞𝔡𝔡𝔯𝔢𝔰𝔰_64ᵇⁱᵗ;

use super::𝒃𝒚𝒕𝒆_𝒆𝒎𝒊𝒕𝒕𝒆𝒓;
use super::𝒃𝒚𝒕𝒆_𝒂𝒓𝒓𝒂𝒚_𝒆𝒎𝒊𝒕𝒕𝒆𝒓;

use super::𝘅𝟴𝟲;

use super::𝘅𝟴𝟲::𝗯𝗮𝘀𝗶𝗰_𝗮𝘀𝘀𝗲𝗺𝗯𝗹𝗲𝗿;

use super::𝘅𝟴𝟲::𝗯𝗮𝘀𝗶𝗰_𝗮𝘀𝘀𝗲𝗺𝗯𝗹𝗲𝗿::*;

use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86;
use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒂𝒃𝒔𝒐𝒍𝒖𝒕𝒆_ₓ86_𝒂𝒅𝒅𝒓𝒆𝒔𝒔;

use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔;
use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒂𝒅𝒅𝒓𝒆𝒔𝒔;
use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔;

use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86;

use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒐𝒑𝒕𝒊𝒐𝒏_𝒇𝒓𝒐𝒎_𝒖𝒏𝒇𝒊𝒍𝒍𝒆𝒅_𝒇𝒍𝒖𝒆𝒏𝒕_𝒗𝒂𝒍𝒖𝒆;

use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞;
use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_32ᵇⁱᵗ;
use super::𝘅𝟴𝟲::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_64ᵇⁱᵗ;

use super::𝘅𝟴𝟲::𝗲𝗺𝗶𝘁_𝗶𝗻𝘀𝘁𝗿𝘂𝗰𝘁𝗶𝗼𝗻_𝗯𝘆𝘁𝗲𝘀::𝐥𝐞𝐠𝐚𝐜𝐲_𝐢𝐧𝐬𝐭𝐫𝐮𝐜𝐭𝐢𝐨𝐧;
use super::𝘅𝟴𝟲::𝗲𝗺𝗶𝘁_𝗶𝗻𝘀𝘁𝗿𝘂𝗰𝘁𝗶𝗼𝗻_𝗯𝘆𝘁𝗲𝘀::𝐢𝐧𝐬𝐭𝐫𝐮𝐜𝐭𝐢𝐨𝐧_𝐛𝐲𝐭𝐞;
use super::𝘅𝟴𝟲::𝗲𝗺𝗶𝘁_𝗶𝗻𝘀𝘁𝗿𝘂𝗰𝘁𝗶𝗼𝗻_𝗯𝘆𝘁𝗲𝘀::𝐧𝐨_𝐩𝐫𝐞𝐟𝐢𝐱;

use super::𝘅𝟴𝟲::𝗲𝗺𝗶𝘁_𝗶𝗻𝘀𝘁𝗿𝘂𝗰𝘁𝗶𝗼𝗻_𝗯𝘆𝘁𝗲𝘀::𝒆𝒎𝒊𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗲𝗺𝗶𝘁_𝗶𝗻𝘀𝘁𝗿𝘂𝗰𝘁𝗶𝗼𝗻_𝗯𝘆𝘁𝗲𝘀::𝒆𝒎𝒊𝒕_𝒎𝒆𝒎𝒐𝒓𝒚_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗲𝗺𝗶𝘁_𝗶𝗻𝘀𝘁𝗿𝘂𝗰𝘁𝗶𝗼𝗻_𝗯𝘆𝘁𝗲𝘀::𝒆𝒎𝒊𝒕_𝒑𝒓𝒆𝒇𝒊𝒙𝒆𝒔_𝒂𝒏𝒅_𝒐𝒑𝒄𝒐𝒅𝒆;
use super::𝘅𝟴𝟲::𝗲𝗺𝗶𝘁_𝗶𝗻𝘀𝘁𝗿𝘂𝗰𝘁𝗶𝗼𝗻_𝗯𝘆𝘁𝗲𝘀::𝒆𝒎𝒊𝒕_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒑𝒓𝒆𝒇𝒊𝒙𝒆𝒔_𝒂𝒏𝒅_𝒐𝒑𝒄𝒐𝒅𝒆;

use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒔𝒆𝒑𝒂𝒓𝒂𝒕𝒆_𝒂𝒄𝒄𝒖𝒎𝒖𝒍𝒂𝒕𝒐𝒓;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒄𝒐𝒖𝒏𝒕𝒆𝒓_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒊𝒐_𝒐𝒑𝒆𝒓𝒂𝒏𝒅;

use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏;

use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_32ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_64ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆;

use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_32ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_64ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_32ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_64ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙;

use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙;

use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒄𝒂𝒍𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏;
use super::𝘅𝟴𝟲::𝗼𝗽𝗲𝗿𝗮𝗻𝗱𝘀::𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒄𝒂𝒍𝒆;

𝖉𝖊𝖋𝖎𝖓𝖊_𝖆𝖘𝖘𝖊𝖒𝖇𝖑𝖊𝖗_𝖎𝖓𝖘𝖙𝖗𝖚𝖈𝖙𝖎𝖔𝖓𝖘!{𝘅𝟴𝟲_𝟲𝟰}
