/*
 * Permission is hereby granted, free of charge, to any human obtaining a copy of this software and associated documentation files
 * (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify,
 * merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit humans to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE
 * LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86;
use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086;
use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒂𝒅𝒅𝒓𝒆𝒔𝒔;
use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒊𝒏𝒅𝒆𝒙;
use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔;
use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒊𝒏𝒅𝒆𝒙;
use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔;
use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒃𝒂𝒔𝒆;

use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86;
use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086;

use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞;
use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_16ᵇⁱᵗ;
use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_32ᵇⁱᵗ;
use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_64ᵇⁱᵗ;

use super::𝗮𝗱𝗱𝗿𝗲𝘀𝘀::𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒔𝒆𝒈𝒎𝒆𝒏𝒕;

pub trait 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Self::𝐭𝐚𝐫𝐠𝐞𝐭: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

// Immediates are always signed on 𝔵86.
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i8 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i8;
}

impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i16 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i16;
}

impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i32 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i32;
}

impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i64 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i64;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized, 𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: Default, const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized, 𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮: Default, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: Default, const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮: 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: core::convert::Into<i16>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    i16,
                    𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮: 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮: 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒄𝒂𝒍𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: core::convert::Into<i32>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    <𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮 as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒄𝒂𝒍𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    i32,
                    𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

pub trait 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒄𝒂𝒍𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Self::𝐭𝐚𝐫𝐠𝐞𝐭: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭: Default;
}

// Same as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏 but accumulator (𝔞𝔩, 𝔞𝔵, 𝔢𝔞𝔵, 𝔯𝔞𝔵, but not 𝔞𝔥) is not merged with other registers.
// Note: it's variant of 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏, and not 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅 because of peculiarity of the
// 𝔵86 ISA: all instructions with special accumulator-only encoding (for explicit, not implicit argument!) also have 8ᵇⁱᵗ version.
pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒔𝒆𝒑𝒂𝒓𝒂𝒕𝒆_𝒂𝒄𝒄𝒖𝒎𝒖𝒍𝒂𝒕𝒐𝒓<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Self::𝐭𝐚𝐫𝐠𝐞𝐭: From<Self>,
{
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

// Immediates are always signed on 𝔵86.
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒔𝒆𝒑𝒂𝒓𝒂𝒕𝒆_𝒂𝒄𝒄𝒖𝒎𝒖𝒍𝒂𝒕𝒐𝒓<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i8 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i8;
}

impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒔𝒆𝒑𝒂𝒓𝒂𝒕𝒆_𝒂𝒄𝒄𝒖𝒎𝒖𝒍𝒂𝒕𝒐𝒓<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i16 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i16;
}

impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒔𝒆𝒑𝒂𝒓𝒂𝒕𝒆_𝒂𝒄𝒄𝒖𝒎𝒖𝒍𝒂𝒕𝒐𝒓<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i32 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i32;
}

impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒔𝒆𝒑𝒂𝒓𝒂𝒕𝒆_𝒂𝒄𝒄𝒖𝒎𝒖𝒍𝒂𝒕𝒐𝒓<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i64 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i64;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized, 𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: Default, const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒔𝒆𝒑𝒂𝒓𝒂𝒕𝒆_𝒂𝒄𝒄𝒖𝒎𝒖𝒍𝒂𝒕𝒐𝒓<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized, 𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮: Default, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: Default, const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒔𝒆𝒑𝒂𝒓𝒂𝒕𝒆_𝒂𝒄𝒄𝒖𝒎𝒖𝒍𝒂𝒕𝒐𝒓<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: core::convert::Into<i16>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒔𝒆𝒑𝒂𝒓𝒂𝒕𝒆_𝒂𝒄𝒄𝒖𝒎𝒖𝒍𝒂𝒕𝒐𝒓<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮>,
          <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭:
              𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭:
              𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          Option<<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                     <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮>,
          Option<<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                     <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          Option<<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                      <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮>,
          Option<<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                      <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                     <<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                      as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                     <<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                      as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                     i16,
                     𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒄𝒂𝒍𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: core::convert::Into<i32>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒔𝒆𝒑𝒂𝒓𝒂𝒕𝒆_𝒂𝒄𝒄𝒖𝒎𝒖𝒍𝒂𝒕𝒐𝒓<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮>,
          <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭:
              𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭:
              𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          Option<<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                     <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮>,
          Option<<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                     <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          Option<<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                      <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮>,
          Option<<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                      <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    <<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                     as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    <<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                     as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    <𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒄𝒂𝒍𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    i32,
                    𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

// In legacy modes this is the same as 𝒈𝒆𝒏𝒆𝒓𝒊𝒄_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅. But in 64ᵇⁱᵗ mode situation is significantly more complex:
// not only there are three separate register clases (𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_8ᵇⁱᵗₗₒ, 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_8ᵇⁱᵗₕᵢ, and other 8ᵇⁱᵗ registers), this
// also affects other arguments!  E.g. address must use 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_XXᵇⁱᵗₙₒᵣₑₓ for base and 𝐚𝐝𝐝𝐫𝐞𝐬𝐬_𝐢𝐧𝐝𝐞𝐱_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_XXᵇⁱᵗₙₒᵣₑₓ
// for index if other argument is of 𝐠𝐩_𝐫𝐞𝐠𝐢𝐬𝐭𝐞𝐫_8ᵇⁱᵗₕᵢ class.
//
// Thankfully most modern instructions (like 3-operand 𝔞𝔡𝔠𝔵 or 𝔟𝔢𝔵𝔱𝔯 instructions) don't have an 8ᵇⁱᵗ variants.
//
// Note: for instructions which 𝗱𝗼 have an 8-bit variants (like 𝔞𝔡𝔡 or 𝔰𝔲𝔟) we have to use that argument even if we are not
// dealing with 8ᵇⁱᵗ instructions.  This is because 𝒂𝒅𝒅_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏𝒔 and 𝒂𝒅𝒅_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏 traits are used
// before we know if we are dealing with 8ᵇⁱᵗ arguments or not.

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Self::𝐭𝐚𝐫𝐠𝐞𝐭: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

// Immediates are always signed on 𝔵86.
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i8 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i8;
}

impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i16 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i16;
}

impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i32 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i32;
}

impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i64 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i64;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized, 𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: Default, const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized, 𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮: Default, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: Default, const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: core::convert::Into<i16>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮>,
          <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭:
              𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭:
              𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          Option<<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                     <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮>,
          Option<<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                     <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          Option<<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                      <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮>,
          Option<<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                      <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                     <<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                      as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                     <<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                      as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                     i16,
                     𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒄𝒂𝒍𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮: core::convert::Into<i32>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮, 𝓭𝓲𝓼𝓹_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮>,
          <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭:
              𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭:
              𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          Option<<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                     <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮>,
          Option<<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                     <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>,
          Option<<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                      <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮>,
          Option<<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                  as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮,
                                      <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭>:
              From<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    <<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                     as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    <<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭
                     as 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮, <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    <𝓼𝓬𝓪𝓵𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒄𝒂𝒍𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                    i32,
                    𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒄𝒂𝒍𝒆_𝒐𝒇_8ᵇⁱᵗ_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Self::𝐭𝐚𝐫𝐠𝐞𝐭: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭: Default;
}

// Additional step for the ᵣₑₓ/ₙₒᵣₑₓ types handling: we want to provide two types: ₙₒᵣₑₓ compliant and ᵣₑₓ-requiring.
// If base is ₙₒᵣₑₓ but index is ᵣₑₓ then we make base ᵣₑₓ. Same with index.
pub trait 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒃𝒂𝒔𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮>: Sized
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒓𝒆𝒙_𝒆𝒙𝒑𝒂𝒏𝒅_𝒊𝒏𝒅𝒆𝒙<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮>: Sized
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

// Shift counter may be 𝔠𝔩 or 8ᵇⁱᵗ immediate, there are no other options.
pub trait 𝒄𝒐𝒖𝒏𝒕𝒆𝒓_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Self::𝐭𝐚𝐫𝐠𝐞𝐭: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒄𝒐𝒖𝒏𝒕𝒆𝒓_𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i8 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i8;
}

// String source may be 𝔡𝔰:[𝔰𝔦], 𝔡𝔰:[𝔢𝔰𝔦], or [𝔯𝔰𝔦] and 𝔡𝔰 can be replaced.
// String destination may be 𝔢𝔰:[𝔡𝔦], 𝔢𝔰:[𝔢𝔡𝔦], or [𝔯𝔡𝔦] and segment can onle be 𝔢𝔰.
// To handle that we have separate traits.
pub trait 𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒔𝒕𝒓𝒊𝒏𝒈_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Self::𝐭𝐚𝐫𝐠𝐞𝐭: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒔𝒐𝒖𝒓𝒄𝒆_𝒔𝒕𝒓𝒊𝒏𝒈_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Self::𝐭𝐚𝐫𝐠𝐞𝐭: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized, 𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒔𝒕𝒓𝒊𝒏𝒈_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized, 𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒔𝒐𝒖𝒓𝒄𝒆_𝒔𝒕𝒓𝒊𝒏𝒈_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

// 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔 includes original bitness (as 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_16ᵇⁱᵗ/32ᵇⁱᵗ/64ᵇⁱᵗ field) and index (𝔡𝔦/𝔢𝔡𝔦/𝔯𝔡𝔦 or 𝔰𝔦/𝔢𝔰𝔦/𝔯𝔰𝔦)
// But we are converting it to 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔/𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒂𝒅𝒅𝒓𝒆𝒔𝒔 which only includes index.
// This means that there are risk of merging, e.g. 𝔞𝔡𝔡𝔯𝔢𝔰𝔰_16ᵇⁱᵗ and 𝔯𝔰𝔦 which shouldn't be possible.
// Separation of 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏 in three traits ensures that we wouldn't accept that code.
#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_16ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒔𝒕𝒓𝒊𝒏𝒈_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_16ᵇⁱᵗ, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_16ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                               <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_16ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                               𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_16ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒔𝒐𝒖𝒓𝒄𝒆_𝒔𝒕𝒓𝒊𝒏𝒈_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_16ᵇⁱᵗ, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_16ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                          <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_16ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                          𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_32ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒔𝒕𝒓𝒊𝒏𝒈_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_32ᵇⁱᵗ, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_32ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                               <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_32ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                               𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_32ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒔𝒐𝒖𝒓𝒄𝒆_𝒔𝒕𝒓𝒊𝒏𝒈_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_32ᵇⁱᵗ, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_32ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                          <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_32ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                          𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_64ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒔𝒕𝒓𝒊𝒏𝒈_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_64ᵇⁱᵗ, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_64ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                               <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_64ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                               𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_64ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒔𝒐𝒖𝒓𝒄𝒆_𝒔𝒕𝒓𝒊𝒏𝒈_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_64ᵇⁱᵗ, 𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_64ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 =
        𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                          <𝓲𝓷𝓭𝓮𝔁_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_64ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                          𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized + 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒔𝒆𝒈𝒎𝒆𝒏𝒕
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_16ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized + 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒊𝒏𝒅𝒆𝒙
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_16ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized + 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒊𝒏𝒅𝒆𝒙
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_32ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized + 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒊𝒏𝒅𝒆𝒙
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_32ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized + 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒊𝒏𝒅𝒆𝒙
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_64ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized + 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒅𝒆𝒔𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏_𝒊𝒏𝒅𝒆𝒙
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒊𝒏𝒅𝒆𝒙_64ᵇⁱᵗ_𝒐𝒇_𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized + 𝒔𝒕𝒓𝒊𝒏𝒈_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒔𝒐𝒖𝒓𝒄𝒆_𝒊𝒏𝒅𝒆𝒙
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

// Instruction 𝔵𝔩𝔞𝔱 accepts unique type of operand with base in 𝔟𝔵, possible segment selection and no index or desplacement.
pub trait 𝒙𝒍𝒂𝒕_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Self::𝐭𝐚𝐫𝐠𝐞𝐭: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized, 𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒙𝒍𝒂𝒕_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

// 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔 includes original bitness (as 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_16ᵇⁱᵗ/32ᵇⁱᵗ/64ᵇⁱᵗ field) and base (𝔟𝔵/𝔢𝔟𝔵/𝔯𝔟𝔵).
// But we are converting it to 𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔 which only includes base.
// This means that there are risk of merging, e.g. 𝔞𝔡𝔡𝔯𝔢𝔰𝔰_16ᵇⁱᵗ and 𝔯𝔟𝔵 which shouldn't be possible.
// Separation of 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏 in three traits ensures that we wouldn't accept that code.
#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_16ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒙𝒍𝒂𝒕_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_8086<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_16ᵇⁱᵗ, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_16ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                           <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as  𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_16ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                           𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮:  𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_32ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒙𝒍𝒂𝒕_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_32ᵇⁱᵗ, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_32ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                           <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as  𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_32ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                           𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

#[allow(non_upper_case_globals)]
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized,
     𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮: 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮:  𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_64ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>,
     const 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮: usize>
    𝒙𝒍𝒂𝒕_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>
    for 𝒇𝒍𝒖𝒆𝒏𝒕_𝒂𝒅𝒅𝒓𝒆𝒔𝒔_ₓ86<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮, 𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞_64ᵇⁱᵗ, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝐮𝐧𝐟𝐢𝐥𝐥𝐞𝐝_𝐟𝐥𝐮𝐞𝐧𝐭_𝐯𝐚𝐥𝐮𝐞, 𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>
    where Option<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮>,
          Option<<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_64ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭>: From<𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮> {
    #[allow(clippy::type_complexity)]
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = 𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒂𝒅𝒅𝒓𝒆𝒔𝒔<<𝓼𝓮𝓰𝓶𝓮𝓷𝓽_𝓽𝔂𝓹𝓮 as 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                           <𝓫𝓪𝓼𝓮_𝓽𝔂𝓹𝓮 as  𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_64ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮>>::𝐭𝐚𝐫𝐠𝐞𝐭,
                                           𝓶𝓮𝓶𝓸𝓻𝔂_𝓼𝓲𝔃𝓮>;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒔𝒆𝒈𝒎𝒆𝒏𝒕_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_16ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized + 𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒃𝒂𝒔𝒆
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_32ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized + 𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒃𝒂𝒔𝒆
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

pub trait 𝒂𝒔𝒔𝒆𝒎𝒃𝒍𝒆𝒓_𝒃𝒂𝒔𝒆_64ᵇⁱᵗ_𝒐𝒇_𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized + 𝒙𝒍𝒂𝒕_𝒊𝒏𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏_𝒃𝒂𝒔𝒆
where Option<Self::𝐭𝐚𝐫𝐠𝐞𝐭>: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

// Instructions 𝔦𝔫/𝔦𝔫𝔰/𝔬𝔲𝔱/𝔬𝔲𝔱𝔰 accepts port number as 8ᵇⁱᵗ immediate or 16ᵇⁱᵗ 𝔡𝔵 register, there are no other choices.
pub trait 𝒊𝒐_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized>: Sized
where Self::𝐭𝐚𝐫𝐠𝐞𝐭: From<Self> {
    type 𝐭𝐚𝐫𝐠𝐞𝐭;
}

// Immediates are always signed on 𝔵86.
impl<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮: ?Sized> 𝒊𝒐_𝒐𝒑𝒆𝒓𝒂𝒏𝒅<𝓪𝓼𝓼𝓮𝓶𝓫𝓵𝓮𝓻_𝓽𝔂𝓹𝓮> for i8 {
    type 𝐭𝐚𝐫𝐠𝐞𝐭 = i8;
}
